Rechnerubung/Week10/karman_street/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{   
    inlet
	{
        type            freestreamVelocity;
        freestreamValue $internalField;
	}
	
	outlet
	{
        type            freestreamVelocity;
        freestreamValue $internalField;
	}
	
	cylinder
	{
        type            noSlip;	
	}
	
	atmosphere
	{
        type            noSlip;	
	}
	
	walls
	{
        type            noSlip;	
	}
	
	"(defaultFaces|front|back)"
	{
        type            empty;
	}
	
}

// ************************************************************************* //
