Rechnerubung/Week10/karman_street/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.015;

boundaryField
{
        inlet
	{
        type            turbulentIntensityKineticEnergyInlet;
		intensity	0.1;
        value           uniform 0.015;	
	}
	
	outlet
	{
        type            zeroGradient;	
	}
	
	cylinder
	{
        type            kqRWallFunction;
        value           uniform 0.015;	
	}
	
	atmosphere
	{
        type            kqRWallFunction;
        value           uniform 0.015;	
	}

	walls
	{
        type            kqRWallFunction;
        value           uniform 0.015;
	}
	
	"(defaultFaces|front|back)"
	{
        type            empty;
	}
	
}


// ************************************************************************* //
