Rechnerubung/Week10/karman_street/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.14;

boundaryField
{
        inlet
	{
	    type            freestream;
        freestreamValue uniform 0.14;
	}
	
	outlet
	{
        type            freestream;
        freestreamValue uniform 0.14;	
	}
	
	cylinder
	{
        type            nutUSpaldingWallFunction;
        value           uniform 0;	
	}
	
	atmosphere
	{
        type            nutUSpaldingWallFunction;
        value           uniform 0;	
	}
	
	walls
	{
        type            nutUSpaldingWallFunction;
        value           uniform 0;
	}

	"(defaultFaces|front|back)"
	{
	    type            empty;
	}
	
}

// ************************************************************************* //
