Rechnerubung/Week10/karman_street/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 79.8596;

boundaryField
{
        inlet
	{
        type            turbulentMixingLengthFrequencyInlet;
		mixingLength	0.0028;
        value           $internalField;	
	}
	
	outlet
	{
        type            zeroGradient;	
	}
	
	cylinder
	{
        type            omegaWallFunction;
        value           $internalField;	
	}
	
	atmosphere
	{
        type            omegaWallFunction;
        value           $internalField;	
	}
	
	walls
	{
        type            omegaWallFunction;
        value           $internalField;
	}

	"(defaultFaces|front|back)"
	{
        type            empty;
	}
	
}


// ************************************************************************* //
