Rechnerubung/Week10/karman_street/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
        inlet
	{
        type            freestreamPressure;
        freestreamValue $internalField;	
	}
	
	outlet
	{
        type            freestreamPressure;
        freestreamValue $internalField;
	}
	
	cylinder
	{
        type            zeroGradient;	
	}
	
	atmosphere
	{
        type            zeroGradient;
	}
	
		walls
	{
        type            zeroGradient;
	}
	
	"(defaultFaces|front|back)"
	{
        type            empty;
	}
	
}

// ************************************************************************* //
