Rechnerubung/Week10/karman_street/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0  -5 -0.1 )      
    (20 -5 -0.1 )        
    (20  5 -0.1 )
    (0   5 -0.1 )

    (0  -5 0.1 )      
    (20 -5 0.1 )        
    (20  5 0.1 )
    (0   5 0.1 )
   
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (75 55 1) simpleGrading (1 1 1)  
);

edges
(
);

boundary
(  
    inlet
    {
        type patch;
        faces
        (
              (0 3 7 4)
        );
    }
    
    
    outlet
    {
        type patch;
        faces
        (
              (1 2 6 5)
        );
    }
    
    atmosphere
    {
        type wall;
        faces
        (
            (2 3 7 6)
        );
    }
    
    walls
    {
        type wall;
        faces
        ( 
            (0 1 5 4)  
        );
    }
    front
    {
        type empty;
        faces
        (  
            (0 1 2 3)  
        );
    }
    back
    {
        type empty;
        faces
        (
            (4 5 6 7)  
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
